# AXMImportOptions Constructor (AXMImportOptions)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AXMImportOptions Constructor (AXMImportOptions)
AXMImportOptions Class See Also
---
Constructs a new instance of AXMImportOptions as a copy of the provided import options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public AXMImportOptions(
	AXMImportOptions option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As AXMImportOptions _
)
```

Visual C++
---
```text
public:
AXMImportOptions(
	AXMImportOptions^ option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.DB..::..AXMImportOptions The AXM import options to be copied.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AXMImportOptions Class
AXMImportOptions Overload
Autodesk.Revit.DB Namespace